# Parameters
nc: 10  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [3,4,4,9,7,6,7,13] 
  - [13,7,12,12,10,19,22,11]  # P3/8
  - [19,17,16,26,33,18,28,32]  # P4/16
  - [47,28,40,58,86,53,97,126]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, CB2D, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, CB2D, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, CB2D, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, CB2D, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)
   
   [ -1, 1, Conv, [ 128, 1, 1 ] ],
   [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
   [ [ -1, 2 ], 1, Concat, [ 1 ] ],  # cat backbone P2
   [ -1, 3, CSPCM, [128] ],  #  (P2/4-xsmall) 21
   

   [ -1, 1, Conv, [ 128, 3, 2 ] ], #22
   [ [ -1, 18,4], 1, Concat, [ 1 ] ],  # cat head P3 
   [ -1, 3, CSPCM, [256] ],  # (P3/8-small) #24
 

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14,6], 1, Concat, [1]],  # cat head P4
   [-1, 3, CSPCM, [512]],  #  (P4/16-medium)  #27
  

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5 
   [-1, 3, CSPCM, [1024]],  #  (P5/32-large) 30
   

   [[21, 24, 27, 30], 1, Detect, [nc,anchors]],  # Detect(P2, P3, P4, P5)
  ]
